w6d4/artshare/app/controllers/users_controller.rb

    def index
        # render plain: "Whatever we want in index"
        sleepy_1 = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params) #params.require(:users).permit(:username, :email)
        #params is a nested hash require looks for the designated key and permit looks for keys within that key
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "'kishi'"], ["email", "'stopeatingsugar@gmail.com'"], ["created_at", "2022-02-03 00:38:20.997609"], ["updated_at", "2022-02-03 00:38:20.997609"]]