w6d5/cats99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("created_at", "updated_at", "birth_date", "color", "name", "sex", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)

    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "GORFIELD"], ["updated_at", "2022-02-04 23:27:41.719303"], ["id", 2]]
---
  def update
    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 4]]
---
  def destroy
    @cat = Cat.find(params[:id])

    if @cat.destroy